; domain
;; Source: https://github.com/josej30/Planner-Sat-Constraints

(define (domain logistics)

(:requirements :strips :typing) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location ?c - city)
         :precondition  (and (at ?t ?from)
                             (in-city ?from ?c)
                             (in-city ?to ?c))
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_logistics_1)

(:domain logistics)

(:objects
	obj0 obj4 obj7 obj8 obj12 obj14 obj23 obj34 obj42 - airport
	obj1 obj5 obj9 obj15 obj35 - city
	obj2 obj11 obj13 obj16 obj17 obj19 obj21 obj24 obj26 obj38 obj41 obj43 obj44 - package
	obj3 obj6 obj18 obj25 obj28 obj31 obj36 obj39 - truck
	obj10 obj22 obj27 obj29 obj30 obj32 obj33 obj37 obj40 - airplane
	obj20 - location
)

(:init
	(in-city obj42 obj5)
	(at obj21 obj12)
	(in-city obj20 obj15)
	(at obj2 obj0)
	(in-city obj4 obj5)
	(at obj26 obj14)
	(at obj10 obj8)
	(at obj41 obj14)
	(at obj43 obj42)
	(at obj38 obj4)
	(at obj24 obj12)
	(in-city obj23 obj5)
	(in-city obj7 obj5)
	(at obj31 obj23)
	(at obj37 obj34)
	(at obj32 obj0)
	(at obj16 obj4)
	(in-city obj34 obj35)
	(at obj17 obj7)
	(at obj28 obj14)
	(at obj40 obj14)
	(at obj36 obj12)
	(at obj18 obj8)
	(at obj6 obj4)
	(at obj27 obj23)
	(at obj33 obj8)
	(in-city obj0 obj1)
	(at obj13 obj12)
	(at obj30 obj4)
	(at obj11 obj8)
	(at obj3 obj0)
	(at obj19 obj12)
	(at obj44 obj42)
	(in-city obj8 obj9)
	(at obj39 obj34)
	(at obj25 obj7)
	(in-city obj12 obj1)
	(at obj29 obj14)
	(at obj22 obj7)
	(in-city obj14 obj15)
)

(:goal (and
	(at obj17 obj34)
	(at obj38 obj34)
	(at obj43 obj8)
	(at obj19 obj4)
	(at obj16 obj0)
	(at obj26 obj12)
	(at obj2 obj8)
	(at obj21 obj34)
	(at obj13 obj7)
	(at obj24 obj14)
	(at obj41 obj8)
	(at obj44 obj23)
	(at obj11 obj4)
))
)

; plan
1. (load obj40 obj41 obj14)
   deleted: (at obj41 obj14)
   added: (in obj41 obj40)
   goals met: 0 of 13
2. (fly obj40 obj14 obj8)
   deleted: (at obj40 obj14)
   added: (at obj40 obj8)
   goals met: 0 of 13
3. (unload obj40 obj41 obj8)
   deleted: (in obj41 obj40)
   added: (at obj41 obj8)
   goals met: 1 of 13
4. (load obj40 obj11 obj8)
   deleted: (at obj11 obj8)
   added: (in obj11 obj40)
   goals met: 1 of 13
5. (fly obj40 obj8 obj4)
   deleted: (at obj40 obj8)
   added: (at obj40 obj4)
   goals met: 1 of 13
6. (load obj40 obj38 obj4)
   deleted: (at obj38 obj4)
   added: (in obj38 obj40)
   goals met: 1 of 13
7. (load obj40 obj16 obj4)
   deleted: (at obj16 obj4)
   added: (in obj16 obj40)
   goals met: 1 of 13
8. (unload obj40 obj11 obj4)
   deleted: (in obj11 obj40)
   added: (at obj11 obj4)
   goals met: 2 of 13
9. (fly obj40 obj4 obj0)
   deleted: (at obj40 obj4)
   added: (at obj40 obj0)
   goals met: 2 of 13
10. (load obj40 obj2 obj0)
   deleted: (at obj2 obj0)
   added: (in obj2 obj40)
   goals met: 2 of 13
11. (unload obj40 obj16 obj0)
   deleted: (in obj16 obj40)
   added: (at obj16 obj0)
   goals met: 3 of 13
12. (fly obj40 obj0 obj34)
   deleted: (at obj40 obj0)
   added: (at obj40 obj34)
   goals met: 3 of 13
13. (unload obj40 obj38 obj34)
   deleted: (in obj38 obj40)
   added: (at obj38 obj34)
   goals met: 4 of 13
14. (fly obj40 obj34 obj8)
   deleted: (at obj40 obj34)
   added: (at obj40 obj8)
   goals met: 4 of 13
15. (unload obj40 obj2 obj8)
   deleted: (in obj2 obj40)
   added: (at obj2 obj8)
   goals met: 5 of 13
16. (load obj29 obj26 obj14)
   deleted: (at obj26 obj14)
   added: (in obj26 obj29)
   goals met: 5 of 13
17. (fly obj29 obj14 obj12)
   deleted: (at obj29 obj14)
   added: (at obj29 obj12)
   goals met: 5 of 13
18. (unload obj29 obj26 obj12)
   deleted: (in obj26 obj29)
   added: (at obj26 obj12)
   goals met: 6 of 13
19. (load obj29 obj24 obj12)
   deleted: (at obj24 obj12)
   added: (in obj24 obj29)
   goals met: 6 of 13
20. (fly obj29 obj12 obj14)
   deleted: (at obj29 obj12)
   added: (at obj29 obj14)
   goals met: 6 of 13
21. (unload obj29 obj24 obj14)
   deleted: (in obj24 obj29)
   added: (at obj24 obj14)
   goals met: 7 of 13
22. (load obj22 obj17 obj7)
   deleted: (at obj17 obj7)
   added: (in obj17 obj22)
   goals met: 7 of 13
23. (fly obj37 obj34 obj12)
   deleted: (at obj37 obj34)
   added: (at obj37 obj12)
   goals met: 7 of 13
24. (load obj37 obj21 obj12)
   deleted: (at obj21 obj12)
   added: (in obj21 obj37)
   goals met: 7 of 13
25. (fly obj37 obj12 obj34)
   deleted: (at obj37 obj12)
   added: (at obj37 obj34)
   goals met: 7 of 13
26. (unload obj37 obj21 obj34)
   deleted: (in obj21 obj37)
   added: (at obj21 obj34)
   goals met: 8 of 13
27. (fly obj30 obj4 obj12)
   deleted: (at obj30 obj4)
   added: (at obj30 obj12)
   goals met: 8 of 13
28. (load obj30 obj19 obj12)
   deleted: (at obj19 obj12)
   added: (in obj19 obj30)
   goals met: 8 of 13
29. (fly obj30 obj12 obj4)
   deleted: (at obj30 obj12)
   added: (at obj30 obj4)
   goals met: 8 of 13
30. (unload obj30 obj19 obj4)
   deleted: (in obj19 obj30)
   added: (at obj19 obj4)
   goals met: 9 of 13
31. (fly obj27 obj23 obj42)
   deleted: (at obj27 obj23)
   added: (at obj27 obj42)
   goals met: 9 of 13
32. (load obj27 obj44 obj42)
   deleted: (at obj44 obj42)
   added: (in obj44 obj27)
   goals met: 9 of 13
33. (fly obj27 obj42 obj23)
   deleted: (at obj27 obj42)
   added: (at obj27 obj23)
   goals met: 9 of 13
34. (unload obj27 obj44 obj23)
   deleted: (in obj44 obj27)
   added: (at obj44 obj23)
   goals met: 10 of 13
35. (fly obj22 obj7 obj12)
   deleted: (at obj22 obj7)
   added: (at obj22 obj12)
   goals met: 10 of 13
36. (load obj22 obj13 obj12)
   deleted: (at obj13 obj12)
   added: (in obj13 obj22)
   goals met: 10 of 13
37. (fly obj22 obj12 obj34)
   deleted: (at obj22 obj12)
   added: (at obj22 obj34)
   goals met: 10 of 13
38. (unload obj22 obj17 obj34)
   deleted: (in obj17 obj22)
   added: (at obj17 obj34)
   goals met: 11 of 13
39. (fly obj22 obj34 obj7)
   deleted: (at obj22 obj34)
   added: (at obj22 obj7)
   goals met: 11 of 13
40. (unload obj22 obj13 obj7)
   deleted: (in obj13 obj22)
   added: (at obj13 obj7)
   goals met: 12 of 13
41. (fly obj10 obj8 obj42)
   deleted: (at obj10 obj8)
   added: (at obj10 obj42)
   goals met: 12 of 13
42. (load obj10 obj43 obj42)
   deleted: (at obj43 obj42)
   added: (in obj43 obj10)
   goals met: 12 of 13
43. (fly obj10 obj42 obj8)
   deleted: (at obj10 obj42)
   added: (at obj10 obj8)
   goals met: 12 of 13
44. (unload obj10 obj43 obj8)
   deleted: (in obj43 obj10)
   added: (at obj43 obj8)
   goals met: 13 of 13
